# Hypothesis Assignment

## 1:  A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [21]:
import pandas as pd
import scipy 
import numpy as np
from scipy import stats

In [23]:
data = pd.read_csv("C:\\Users\\Praveen\\ASSIGNMENT ANSWERS\\Cutlets.csv")

In [24]:
data

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

# Assumption 
## H0 : Insignificant
## H1 : Significant

# Test : Two tail Testing

In [25]:
stats.ttest_ind(data['Unit A'],data['Unit B'])

Ttest_indResult(statistic=0.7228688704678061, pvalue=0.4722394724599501)

# P value > 0.05
## Therefore we conclude that there is no significant difference in the diameter of cutlets in both the units

# 2:  A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.

In [27]:
data1 = pd.read_csv("C:\\Users\\Praveen\\ASSIGNMENT ANSWERS\\LabTAT.csv")
data1

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

# Assumption :
## H0 : No Difference in TAT
## H1 : Difference in TAT

# Anova Test :

In [28]:
stats.f_oneway(data1['Laboratory 1'],data1['Laboratory 2'],data1['Laboratory 3'],data1['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

# Pvalue < 0.05
# Therefore we conclude that there is any difference in average TAT among the different laboratories.

# 3 :      Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [30]:
df = pd.read_csv('C:\\Users\\Praveen\\ASSIGNMENT ANSWERS\\BuyerRatio.csv')
df

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [31]:
df.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [32]:
dm = df.copy()
dm['Observed Values']=dm['Observed Values'].map({'Males':0,'Females':1})
dm

   Observed Values  East  West  North  South
0                0    50   142    131     70
1                1   435  1523   1356    750

In [33]:
Chisquares_results = scipy.stats.chi2_contingency(dm)

Chi_square = [['','Test Statistic','p-value'],['Sample Data',Chisquares_results[0],Chisquares_results[1]]]
Chi_square

[['', 'Test Statistic', 'p-value'],
 ['Sample Data', 1.6929696469183673, 0.7919942975413565]]

# 4 : TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [43]:
d1 = pd.read_csv('C:\\Users\\Praveen\\ASSIGNMENT ANSWERS\\Costomer+OrderForm.csv')
d1

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [24]:
data_mapped= d1.copy()
data_mapped['Phillippines']=data_mapped['Phillippines'].map({'Error Free':0,'Defective':1})
data_mapped['Indonesia']=data_mapped['Indonesia'].map({'Error Free':0,'Defective':1})
data_mapped['Malta']=data_mapped['Malta'].map({'Error Free':0,'Defective':1})
data_mapped['India']=data_mapped['India'].map({'Error Free':0,'Defective':1})
data_mapped

     Phillippines  Indonesia  Malta  India
0               0          0      1      0
1               0          0      0      1
2               0          1      1      0
3               0          0      0      0
4               0          0      1      0
..            ...        ...    ...    ...
295             0          0      0      0
296             0          0      0      0
297             0          0      1      0
298             0          0      0      0
299             0          1      1      0

[300 rows x 4 columns]

In [25]:
data_mapped.describe()

       Phillippines   Indonesia       Malta       India
count    300.000000  300.000000  300.000000  300.000000
mean       0.096667    0.110000    0.103333    0.066667
std        0.295997    0.313413    0.304902    0.249861
min        0.000000    0.000000    0.000000    0.000000
25%        0.000000    0.000000    0.000000    0.000000
50%        0.000000    0.000000    0.000000    0.000000
75%        0.000000    0.000000    0.000000    0.000000
max        1.000000    1.000000    1.000000    1.000000

In [26]:
stats.f_oneway(data_mapped.Phillippines,data_mapped.Indonesia,data_mapped.Malta,data_mapped.India)

F_onewayResult(statistic=1.286168556089167, pvalue=0.2776780955705948)

## Fantaloons Sales managers commented that % of males versus females walking in to the store differ based on day of the week. Analyze the data and determine whether there is evidence at 5 % significance level to support this hypothesis

In [37]:
d3 = pd.read_csv('C:\\Users\\Praveen\\ASSIGNMENT ANSWERS\\Faltoons.csv')

In [38]:
d3

    Weekdays Weekend
0       Male  Female
1     Female    Male
2     Female    Male
3       Male  Female
4     Female  Female
..       ...     ...
395   Female    Male
396   Female  Female
397   Female  Female
398   Female    Male
399   Female  Female

[400 rows x 2 columns]

In [29]:
dm=d3.copy()

In [30]:
dm['Weekdays']=dm['Weekdays'].map({'Male':0,'Female':1})
dm['Weekend']=dm['Weekend'].map({'Male':0,'Female':1})

In [31]:
dm

     Weekdays  Weekend
0           0        1
1           1        0
2           1        0
3           0        1
4           1        1
..        ...      ...
395         1        0
396         1        1
397         1        1
398         1        0
399         1        1

[400 rows x 2 columns]

In [32]:
dm.describe()

         Weekdays     Weekend
count  400.000000  400.000000
mean     0.717500    0.582500
std      0.450779    0.493764
min      0.000000    0.000000
25%      0.000000    0.000000
50%      1.000000    1.000000
75%      1.000000    1.000000
max      1.000000    1.000000

In [33]:
c = pd.crosstab(dm.Weekdays,dm.Weekend)
c

Weekend     0    1
Weekdays
0          47   66
1         120  167

In [34]:
stats.ttest_ind(dm.Weekdays,dm.Weekend)

Ttest_indResult(statistic=4.038383581687957, pvalue=5.9013879428528154e-05)

## Pvalue < 0.05
## Hence it is significant that % of males versus females walking in to the store differ based on day of the week